/* Menu & Status */
"窗口布局" = "窗口布局";
"登录时启动" = "登录时启动";
"显示主窗口" = "显示主窗口";
"检查权限" = "检查权限";
"退出 FlowTouch" = "退出 FlowTouch";
"运行中" = "运行中";
"需要输入监控权限" = "需要输入监控权限";
"未检测到触控板" = "未检测到触控板";
"需要辅助功能权限" = "需要辅助功能权限";
"正在启动..." = "正在启动...";
"等待首次触摸" = "等待首次触摸";
"完成授权后回到应用，FlowTouch 会自动重新检查。" = "完成授权后回到应用，FlowTouch 会自动重新检查。";
"如果系统没有弹出授权窗口，请使用每一项右侧的“打开设置”。" = "如果系统没有弹出授权窗口，请使用每一项右侧的“打开设置”。";
"打开设置" = "打开设置";
"待授权" = "待授权";
"← 左半屏" = "← 左半屏";
"右半屏 →" = "右半屏 →";
"↑ 最大化" = "↑ 最大化";
"◎ 居中" = "◎ 居中";
"搜索" = "搜索";
"关闭搜索" = "关闭搜索";
"搜索规则..." = "搜索规则...";
"FlowTouch 运行中" = "FlowTouch 运行中";
"未激活" = "未激活";
"FlowTouch - Two-Finger Window Control" = "FlowTouch - 双指窗口控制";
"About FlowTouch" = "关于 FlowTouch";

/* Settings */
"设置" = "设置";
"语言" = "语言";
"跟随系统" = "跟随系统";
"简体中文" = "简体中文";
"English" = "English";
"完成" = "完成";
"启动" = "启动";
"程序坞" = "程序坞";
"在程序坞中显示图标" = "在程序坞中显示图标";
"在菜单中显示图标" = "在菜单中显示图标";
"手势学习" = "手势学习";
"试试手势" = "试试手势";
"学习模式" = "学习模式";
"灵敏度" = "灵敏度";
"滑动阈值" = "滑动阈值";
"权限状态" = "权限状态";
"输入监控" = "输入监控";
"已授权" = "已授权";
"授权" = "授权";
"辅助功能" = "辅助功能";
"系统手势冲突" = "系统手势冲突";
"手势冲突" = "手势冲突";
"打开触控板设置" = "打开触控板设置";
"规则管理" = "规则管理";
"当前规则数" = "当前规则数";
"条" = "条";
"导出规则" = "导出规则";
"导入规则" = "导入规则";
"数据" = "数据";
"重置规则为默认" = "重置规则为默认";
"导出成功" = "导出成功";
"规则已导出到桌面" = "规则已导出到桌面";
"导入失败" = "导入失败";
"无效的规则文件格式" = "无效的规则文件格式";
"导出失败" = "导出失败";
"读取文件失败" = "读取文件失败";
"选择文件失败" = "选择文件失败";
"system_gesture_conflict_format" = "系统「%@」与 FlowTouch「%@」可能冲突";
"确定要重置所有规则吗？" = "确定要重置所有规则吗？";
"这将删除所有自定义规则。" = "这将删除所有自定义规则。";
"重置" = "重置";
"取消" = "取消";
"确定" = "确定";

/* Welcome */
"Welcome to FlowTouch" = "欢迎使用 FlowTouch";
"Control windows with trackpad gestures" = "使用触控板手势控制窗口";
"Choose a starting configuration:" = "选择一个开始配置：";
"Quick Start" = "快速开始";
"3 gestures: Left, Right, Maximize" = "3 个手势：左、右、最大化";
"Full Setup" = "完整配置";
"8 directions: All window positions" = "8 个方向：全部窗口位置";
"Start from scratch" = "从零开始";
"Uses 3-finger gestures to avoid conflicts with system scrolling" = "使用三指手势以避免与系统滚动冲突";
"Fingers" = "手指数";
"Swipe Directions" = "滑动方向";
"Tap Actions" = "点击动作";
"Pinch Gestures" = "捏合手势";
"Pinch gestures are disabled" = "捏合手势已禁用";
"Hide" = "隐藏";
"Swipe on trackpad to snap windows" = "在触控板上滑动以贴靠窗口";
"Right-click actions to test them" = "右键操作项可以直接测试";
"Enable 3 or 4 fingers for more gestures" = "启用 3 指或 4 指可获得更多手势";
"Dashed borders = not configured" = "虚线边框表示尚未配置";

/* No Device / Init */
"未找到触控板" = "未找到触控板";
"请连接 Magic Trackpad 或使用 MacBook 内置触控板" = "请连接 Magic Trackpad 或使用 MacBook 内置触控板";
"正在检测..." = "正在检测...";
"重新检测" = "重新检测";
"可能是权限问题" = "可能是权限问题";
"检查输入监控权限" = "检查输入监控权限";

/* Permission Guidance */
"Permissions Required" = "需要权限";
"FlowTouch needs system permissions to monitor trackpad input and control windows." = "FlowTouch 需要系统权限来监听触控板输入并控制窗口。";
"Input Monitoring" = "输入监控";
"Required to detect trackpad gestures" = "用于识别触控板手势";
"Accessibility" = "辅助功能";
"Required to move and resize windows" = "用于移动与调整窗口大小";
"Setup Instructions" = "设置说明";
"Open System Settings > Privacy & Security" = "打开 系统设置 > 隐私与安全性";
"Select 'Input Monitoring' and enable FlowTouch" = "选择“输入监控”并启用 FlowTouch";
"Select 'Accessibility' and enable FlowTouch" = "选择“辅助功能”并启用 FlowTouch";
"Restart the app if needed" = "必要时重启应用";
"Developer Note" = "开发者提示";
"Rebuilding in Xcode invalidates permissions. Remove the app from the list and re-add it after each rebuild." = "在 Xcode 重新构建会使权限失效，请删除并重新添加应用。";
"Ensure a Magic Trackpad is connected or you're using a MacBook with built-in trackpad." = "请确保已连接 Magic Trackpad 或使用 MacBook 内置触控板。";
"Retry" = "重试";
"Request Accessibility" = "请求辅助功能";
"Debug Log" = "调试日志";
"No logs yet..." = "暂无日志...";

/* Action Selection */
"选择操作" = "选择操作";
"选择手势触发后执行的窗口操作" = "选择手势触发后执行的窗口操作";
"窗口控制" = "窗口控制";
"屏幕与空间" = "屏幕与空间";
"桌面与系统" = "桌面与系统";
"应用程序" = "应用程序";
"标签页" = "标签页";
"媒体控制" = "媒体控制";
"截图" = "截图";
"自定义" = "自定义";

/* Rules */
"规则" = "规则";
"所有规则" = "所有规则";
"已启用" = "已启用";
"已停用" = "已停用";
"添加规则" = "添加规则";
"编辑" = "编辑";
"复制" = "复制";
"删除" = "删除";
" (副本)" = " (副本)";
"全局" = "全局";
"其他" = "其他";

/* Action Names */
"左半屏" = "左半屏";
"右半屏" = "右半屏";
"上半屏" = "上半屏";
"下半屏" = "下半屏";
"左上角" = "左上角";
"右上角" = "右上角";
"左下角" = "左下角";
"右下角" = "右下角";
"最大化" = "最大化";
"居中" = "居中";
"还原" = "还原";
"最小化" = "最小化";
"关闭" = "关闭";
"全屏" = "全屏";
"撤销" = "撤销";
"垂直最大化" = "垂直最大化";
"水平最大化" = "水平最大化";
"全部最小化" = "全部最小化";
"恢复全部" = "恢复全部";
"移至下个屏幕" = "移至下个屏幕";
"移至上个屏幕" = "移至上个屏幕";
"移至下个空间" = "移至下个空间";
"移至上个空间" = "移至上个空间";
"切换左空间" = "切换左空间";
"切换右空间" = "切换右空间";
"调度中心" = "调度中心";
"显示桌面" = "显示桌面";
"应用窗口" = "应用窗口";
"启动台" = "启动台";
"聚焦搜索" = "聚焦搜索";
"锁定屏幕" = "锁定屏幕";
"屏幕保护" = "屏幕保护";
"退出应用" = "退出应用";
"隐藏应用" = "隐藏应用";
"隐藏其他" = "隐藏其他";
"切换" = "切换";
"切换应用" = "切换应用";
"上个应用" = "上个应用";
"新建标签页" = "新建标签页";
"关闭标签页" = "关闭标签页";
"下一个标签页" = "下一个标签页";
"上一个标签页" = "上一个标签页";
"播放/暂停" = "播放/暂停";
"下一曲" = "下一曲";
"上一曲" = "上一曲";
"音量增加" = "音量增加";
"音量减少" = "音量减少";
"静音" = "静音";
"亮度增加" = "亮度增加";
"亮度减少" = "亮度减少";
"截取全屏" = "截取全屏";
"截取区域" = "截取区域";
"截取窗口" = "截取窗口";
"自定义快捷键" = "自定义快捷键";
"未设置" = "未设置";

/* Short Names */
"左" = "左";
"右" = "右";
"上" = "上";
"下" = "下";
"左上" = "左上";
"右上" = "右上";
"左下" = "左下";
"右下" = "右下";
"↕最大" = "↕最大";
"↔最大" = "↔最大";
"全最小" = "全最小";
"→屏幕" = "→屏幕";
"←屏幕" = "←屏幕";
"→空间" = "→空间";
"←空间" = "←空间";
"空间←" = "空间←";
"空间→" = "空间→";
"调度" = "调度";
"桌面" = "桌面";
"窗口" = "窗口";
"搜索" = "搜索";
"锁屏" = "锁屏";
"屏保" = "屏保";
"退出" = "退出";
"隐藏" = "隐藏";
"上个" = "上个";
"新标签" = "新标签";
"关标签" = "关标签";
"下标签" = "下标签";
"上标签" = "上标签";
"播放" = "播放";
"音量+" = "音量+";
"音量-" = "音量-";
"亮度+" = "亮度+";
"亮度-" = "亮度-";
"截全屏" = "截全屏";
"截区域" = "截区域";
"截窗口" = "截窗口";
"快捷键" = "快捷键";
"添加" = "添加";

/* Gesture Types */
"滑动" = "滑动";
"点击" = "点击";
"捏合" = "捏合";
"在触控板上滑动手指" = "在触控板上滑动手指";
"快速点击手指" = "快速点击手指";
"捏合或张开手指" = "捏合或张开手指";

/* Tap Types */
"单击" = "单击";
"双击" = "双击";
"三击" = "三击";
"1次点击" = "1次点击";
"2次点击" = "2次点击";
"3次点击" = "3次点击";

/* Pinch */
"张开" = "张开";
"Pinch In" = "捏合";
"Pinch Out" = "张开";

/* Misc */
"Not configured" = "未配置";
"gesture_swipe_format" = "%d指%@滑";
"gesture_tap_format" = "%d指%@";
"configured_count_format" = "已配置 %d/%d";
"swipe_title_format" = "滑动 %@";
"finger_swipe_format" = "%d 指滑动";
"finger_action_title_format" = "%d 指 %@";
"action_failed_format" = "%@失败";
"disable_fingers_format" = "禁用 %d 指";
"enable_fingers_format" = "启用 %d 指";
"Change Action" = "更改操作";
"Set Action" = "设置操作";
"Click to change • Right-click to test" = "点击更改 • 右键测试";
"Click to set action" = "点击设置操作";
"Test: %@" = "测试：%@";
"about_informative_text" = "版本 1.0\n\n适用于 macOS 的双指窗口管理。\n滑动即可贴靠窗口，简单直接。\n\n手势说明：\n• 左/右滑动 → 半屏\n• 向上滑动 → 最大化\n• 向下滑动 → 还原\n• 对角滑动 → 四分屏\n• 向内捏合 → 居中\n• 向外张开 → 最大化";
"手势学习模式" = "手势学习模式";
"在触控板上尝试手势，查看识别结果" = "在触控板上尝试手势，查看识别结果";
"学习模式已启用 - 手势不会执行动作" = "学习模式已启用 - 手势不会执行动作";
"清空记录" = "清空记录";
"在触控板上尝试手势" = "在触控板上尝试手势";
"支持滑动、点击、捏合手势" = "支持滑动、点击、捏合手势";

/* Add/Edit Rule Sheet */
"触发条件" = "触发条件";
"手势类型" = "手势类型";
"手指数量" = "手指数量";
"滑动方向" = "滑动方向";
"点击类型" = "点击类型";
"捏合方向" = "捏合方向";
"执行动作" = "执行动作";
"生效范围" = "生效范围";
"应用范围" = "应用范围";
"选择应用" = "选择应用";
"未选择" = "未选择";
"特定应用" = "特定应用";
"替换" = "替换";
"保存" = "保存";
"没有相关规则" = "没有相关规则";
"编辑规则" = "编辑规则";
"修改手势触发与执行操作" = "修改手势触发与执行操作";
"配置新的手势触发与执行操作" = "配置新的手势触发与执行操作";
"手势已被占用" = "手势已被占用";
"conflict_current_use_format" = "当前用于%@";
"conflict_replace_hint" = "点击「替换」覆盖现有配置";
"conflict_will_replace_format" = "此手势已用于「%@」，保存将会替换";
"指" = "指";
"选择触发规则的目标应用" = "选择触发规则的目标应用";
"搜索应用..." = "搜索应用...";
